-------------------------------------------------------------
--  @file   RuleTable.lua
--  @brief  规则内容
--  @author Linxiancheng
--  @DateTime:2017-04-20 16:30:22
--  Version: 1.0.0
--  Company  SteveSoft LLC.colourSliderValueChanged(sender, controlEvent)
--  Copyright  Copyright (c) 2016
--============================================================

local textIndent = "　　" -- 首行缩进
local commonSmallTitle = textIndent .. "您需要邀请好友，创建房间，好友按照房间号加入房间，就可以在一起打麻将了！就等于手机上有了棋牌室！建个好友麻将群，组局更迅速！"

local Content =
{
    {
        redTitle = "\n【麻将用具】",
        content  = textIndent .. "使用筒（1至9）、条（1至9）、东南西北中发白（各四张）共100张。"
    },
    {
        redTitle = "\n【庄家规则】",
        content  = textIndent .. "谁胡谁坐庄；多家抢杠胡被抢杠的人坐庄。"
    },
    {
        redTitle = "\n【黄庄规则】",
        content  = textIndent .. "留马黄庄。杠了就有，黄庄不黄杠，  （马跟杠时黄庄黄杠）杠在游戏后结算；黄庄不下庄算连庄；多家抢杠胡被抢杠的人坐庄。"
    },
    {
        redTitle = "\n【基本玩法】",
        content  = textIndent .. "1、自摸：三家输给赢家；点炮：不可以点炮。"
    },
    {
        content  = textIndent .. "2、明杠：就是你手里有三张一样的牌，别人打出另外一张，你杠了。明杠谁点谁给3分；。"
    },
    {
        content  = textIndent .. " 3、暗杠：自己抓到四张相同的牌杠下来，称为暗杠；暗杠要亮出。暗杠每家给2分；"
    },
    {
        content  = textIndent .. "4、补杠：你自己已经碰了的牌，自己在抓到最后一张杠了，称为补杠。补杠每家给1分；"
    },
    {
        content  = textIndent .. "5、最后一张：最后一张牌要去抓并出手；直杠不杠先碰能直接杠，算补杠；补杠过后也可以杠；暗杠过后也可以杠。"
    },
    {
        content  = textIndent .. "6、杠开：杠开正常结算。点杠杠开也正常结算或点杠杠开需要包三家（选项）。注：全包不包杠分；"
    },
    {
        content  = textIndent .. "7、抢杠胡：抢杠胡包三家，多家抢杠胡，被抢杠者分别包三家，（杠分不用包），多家抢杠胡，被抢杠者坐庄。多家抢杠胡，翻马，马共用，胡家分别看自己的马。"
    },
    {
        content  = textIndent .. "8、四鬼可胡：选择四鬼可胡时，四鬼可以直接胡牌；与无鬼选项互斥；不可一炮多响；不需要报听；无过圈碰胡；无杠后炮说法；无天胡地胡说法，正常算。"
    },
     {
        content  = textIndent .. "9、幺九，全风，七对可胡，十三幺、十三烂不可胡；鬼牌：发牌后，随机翻牌+1为鬼牌；马跟底分：胡牌结算有多大马多大。马跟杠:在胡牌基础上结算后，在根据杠进行二次计算。"
    },
    -- {
    --     redTitle = "\t【特殊玩法】",
    --     content  = textIndent .. "1、庄马：1.5.9东风.红中是马；下家马：2.6.南风.发财是马；对家马：3.7.西风.白板是马；上家马：4.8.北风是马"
    -- },
    -- {
    --     content  = textIndent .. "2、直杠不杠先碰，之后不能再杠，系统只会提醒一次。杠开（杠爆）：谁点杠谁付3三家积分，如果是自己抓的杠，杠开3家付（付自己的），正常翻马。"
    -- },
    -- {
    --     content  = textIndent .. "3、翻马的牌不足4张时，有几张算几张。最后一张牌，不胡就黄庄黄杠，有杠也不算，只提示一次。"
    -- },
    -- {
    --     content  = textIndent .. "4、多家抢杠胡，大家都看被抢杠的人的马，例如，被抢者的马是2 6 南 发 ，那所有胡牌者都看2 6 南 发；"
    -- },
    {
        redTitle = "\n【胡牌类型】",
        content  = textIndent .. "1、胡牌结算：胡牌2分，马2分；明杠谁点谁付3分，补杠三家各付1分；自摸不加番不加底正常结算；暗杠三家各付2分。"
    },
    {
        content  = textIndent .. "2、在翻鬼模式下，胡牌正常，选择“无鬼翻倍”后无鬼胡*2；杠开算自摸，无杠后炮。点杠杠开包三家（选项）；"
    },
    {
        content  = textIndent .. "3、抢杠胡包三家，抢杠的杠不算分。如果被一家抢杠，那被抢杠者就要给3份相同的分给赢家，如果被两家，三家抢杠，那么按照打牌的顺序提示胡牌，被抢杠者要给三家的分。但是之前的杠分该怎么给就怎么给，不用被抢杠者付。"
    },
}
local ruleTable =
{
    smallTitle = commonSmallTitle,
    ruleContent = Content
}

return ruleTable