-------------------------------------------------------------
--  @file   RuleTable.lua
--  @brief  规则内容
--  @author Linxiancheng
--  @DateTime:2017-04-20 16:30:22
--  Version: 1.0.0
--  Company  SteveSoft LLC.colourSliderValueChanged(sender, controlEvent)
--  Copyright  Copyright (c) 2016
--============================================================

local textIndent = "　　" -- 首行缩进
local commonSmallTitle = textIndent .. "您需要邀请好友，创建房间，好友按照房间号加入房间，就可以在一起打麻将了！就等于手机上有了棋牌室！建个好友麻将群，组局更迅速！"

local Content =
{
    {
        redTitle = "\n【麻将用具】",
        content  = textIndent .. "66江门杠杠胡麻将”由条、饼、万、东南西北中發白组成，合计136张牌。"
    },
    {
        redTitle = "\n【庄家规则】",
        content  = textIndent .. "谁胡牌谁坐庄，黄庄后不换庄。抢杠时，被抢杠者坐庄，玩家进入房间时，随机分配座位，第一把牌由在“东风”的玩家当庄；"
    },
    {
        redTitle = "\n【黄庄规则】",
        content  = textIndent .. "抓完所有的牌。杠了就有，黄庄不黄杠；杠在游戏中即时结算，黄庄不下庄；多家抢杠胡或者一炮多响，被抢杠或点炮的人坐庄"
    },
    {
        redTitle = "\n【基本玩法】",
        content  = textIndent .. "1、黄庄：抓完所有的牌。杠了就有，黄庄不黄杠；杠在游戏中即时结算，黄庄不下庄；"
    },
    {
        content  = textIndent .. "2、多家抢杠胡或者一炮多响，被抢杠或点炮的人坐庄。"
    },
    {
        content  = textIndent .. "3、庄家：谁胡谁坐庄；多家抢杠胡或者一炮多响，被抢杠或点炮的人坐庄。"
    },
     {
        content  = textIndent .. "4、点炮：可以点炮胡（选项），点炮付自己。"
    },
     {
        content  = textIndent .. "5、自摸：三家输给赢家。"
    },
     {
        content  = textIndent .. "6、明杠：就是你手里有三张一样的牌，别人打出另外一张，你杠了。（手中有3张不杠先碰就不能再补杠了）"
    },
     {
        content  = textIndent .. "7、暗杠：自己抓到四张相同的牌杠下来，称为暗杠；暗杠要亮出。"
    },
     {
        content  = textIndent .. "8、补杠：你自己已经碰了的牌，自己在抓到最后一张杠了，称为补杠。"
    },
        {
        content  = textIndent .. "9、出手：最后一张牌要去抓，但是不出手。"
    },
        {
        content  = textIndent .. "10、十二张落地：玩家通过碰，杠（只限明杠）；形成单吊的情况，为十二张落地，十二张落地最后一个碰或者直杠的放碰或者放杠者在胡牌后包三家；最后一个是暗杠的不算十二张落地。"
    },
        {
        content  = textIndent .. "11、杠开：直杠杠开包三家（放杠的人包）；如果是直杠再杠再杠开也是放杠的人包。暗杠杠开或者补杠杠开不需要包三家，正常结算。"
    },
     {
        content  = textIndent .. "12、抢杠胡：抢杠胡包三家，多家抢杠胡，被抢杠者分别包三家，（杠积分不用包），多家抢杠胡，被抢杠者坐庄。多家抢杠胡，翻马10个共用，看被抢杠者的马来算。"
    },
     {
        content  = textIndent .. "13、一炮多响：点炮规则下，可以一炮多响，点炮付自己。一炮多想翻马10个共用，看被点炮者的马来算；不需要报听；有过圈碰胡"
    },
    {
        content  = textIndent .. "14、翻马：胡牌以后按照行牌顺序拿N张牌作为马牌，中马以庄家为東风的方位顺序来决定。胡牌后马不足有几马算几马，没马不算马。"
    },


    {
        redTitle = "\n【特殊玩法】",
        content  = textIndent .. "1、庄马：1.5.9东风.红中是马。下家马：2.6.南风.发财是马。对家马：3.7.西风.白板是马。上家马：4.8.北风是马。"
    },
    {
       content  = textIndent .. "2、直杠不杠先碰，之后不能再杠，系统只会提醒一次。杠开（杠爆）：谁点杠谁付3三家积分，如果是自己抓的杠，杠开3家付（付自己的），正常翻马。如果碰牌的时候，没有碰，那么就需要过圈（自己打过牌）以后才能再碰。翻马的牌不足时，有几张算几张。"
    },
    {
        content  = textIndent .. "3、最后一张牌，不胡就黄庄黄杠，有杠也不算，只提示一次。 多家抢杠胡，大家都看被抢杠的人的马，例如，被抢者的马是2 6 南 发 ，那所有胡牌者都看2 6 南 发；被抢杠者要给三家各自不同的牌型加中马的分。"
    },
    

    {
        redTitle = "\n【胡牌类型】",
        content  = textIndent .. "1、胡牌结算：自摸胡2底，马1底明杠谁点谁付3底，补杠三家各付1底。自摸不加番不加底。暗杠三家各付2底。"
    },
    {
        content  = textIndent .. "2、点炮模式下杠了的分数在游戏中即时结算，黄庄不黄杠；自摸模式下杠了的分数在游戏结算时结算，黄庄黄杠。杠开谁点杠谁包三家，如果自己暗杠或者补杠并杠开则3家各自付，正常翻马。12张落地包三家。只包自摸的玩家，如果玩家是被点炮胡的，就不用包了。"
    },
    {
        content  = textIndent .. "3、抢杠胡包三家，抢杠的杠不算积分。如果被一家抢杠，那被抢杠者就要给3份相同的积分给赢家，如果被两家，三家抢杠，那么按照打牌的顺序提示胡牌，被抢杠者要给三家各自不同牌型的积分。但是之前的杠积分该怎么给就怎么给，不用被抢杠者付。胡牌翻马，正常翻，不够时有几张算几张。"
    },



}

local ruleTable =
{
    smallTitle = commonSmallTitle,
    ruleContent = Content
}

return ruleTable