--region *.lua
--Date
--此文件由[BabeLua]插件自动生成
local userYinSiXieYiStr = 
[[北京大圣掌游文化发展有限公司（以下简称“大圣公司”或“我们”）非常重视网络游戏用户（以下简称“用户”或“您”）的隐私。大圣公司作为《大圣棋牌》游戏的开发商，为保障用户的隐私权、规范对用户个人信息的利用，特制定本隐私政策。
   本隐私政策解释了用户个人信息收集和使用的有关情况，适用于大圣公司《大圣棋牌》网络游戏服务（以下简称“本服务”。请用户仔细阅读以下全部内容，如用户不同意本隐私政策的任意内容，请不要注册或使用本服务。
个人信息的收集和使用：
   个人信息是可用于识别或联系特定个人的数据。
   任何时候用户在登录和使用本服务时，都可能会被要求提供姓名、性别、出生日期、血型、爱好、手机号码、密码等个人信息。该等个性化信息可由用户进行查阅、编辑及自定义。一般情况下，您可随时浏览、修改自己提交的信息，但出于安全性和用户年龄识别的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。
   大圣公司及第三方渠道合作运营商可能在如下情形使用您的个人信息：
1、	使用您的个人信息（例如出生日期）来验证身份、协助识别用户，以及确定适当的服务；
2、	在游戏对局、排行榜等场景中向游戏的其他用户开放以促进用户之间的社交互动；
3、	将个人信息用于用户数据分析和研究等内部目的，以改进游戏产品服务和用于用户之间的沟通；
4、	使用您的个人信息来进行用户数据分析和市场调研。
除此之外，大圣公司不会将您的个人信息用于任何其他商业目的，或在任何场合对第三方披露该等个人信息，除非满足下述情形之一：
1、	根据法律法规的规定；
2、	根据司法机关或行政机关基于法定程序的要求；
3、	符合您与大圣公司之间的相关服务条框的约定；
4、	用户或用户监护人授权大圣公司披露；
5、	大圣公司为了维护自己合法权益而向用户提起诉讼或者仲裁时；
6、	应用户监护人的合法要求而提供用户个人身份信息时；
7、	如果发生重组、合并或出售，则我们可将我们收集的用户的个人信息转让给相关第三方。

未成年人的个人信息保护：
   大圣公司非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用本服务前，应事先取得您家长或法定监护人的书面同意。大圣公司根据相关司法辖区的规定保护未成年人的个人信息。

个人信息的安全：
   大圣公司一贯积极地采取技术与管理等合理措施保障用户账号的安全、有效；大圣公司将采取各项有效且必要的措施以保护用户的隐私安全，并使用合理的安全技术措施来保护用户的隐私不被未经授权的访问、使用或泄露。如果您对本隐私政策有任何疑问，请联系我们。
   大圣公司可随时对本隐私政策加以更新。如果我们对隐私政策作出重大变更，我们将在公司网站及相关游戏产品界面上发布通告和更新的隐私政策。
特别提示：本隐私政策仅适用于使用大圣公司《大圣棋牌》网络游戏服务的用户，若本隐私政策与您与大圣公司之间的相关服务条款中任一条款不一致的，以本隐私政策的约定为准。
]];

return userYinSiXieYiStr


--endregion
